# ExportLinetypeKey Constructor (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeKey Constructor (String)
ExportLinetypeKey Class See Also
---
Constructs a new default ExportLinetypeKey using the original line type name as input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeKey(
	string originalLinetypeName
)
```

Visual Basic
---
```text
Public Sub New ( _
	originalLinetypeName As String _
)
```

Visual C++
---
```text
public:
ExportLinetypeKey(
	String^ originalLinetypeName
)
```

# ### Parameters
originalLinetypeName
    Type: System..::..String The original line type name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace